# ApplicableTotalLengthRoundingMethod Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricRoundingManager..::..ApplicableTotalLengthRoundingMethod Property
FabricRoundingManager Class See Also
---
The applicable rounding method for Cut Overall Length and Cut Overall Width parameters.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RoundingMethod ApplicableTotalLengthRoundingMethod { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplicableTotalLengthRoundingMethod As RoundingMethod
	Get
```

Visual C++
---
```text
public:
property RoundingMethod ApplicableTotalLengthRoundingMethod {
	RoundingMethod get ();
}
```

# Remarks
IsActiveOnElement property of ReinforcementSettings FabricRoundingManager has to be true. ApplicableTotalLengthRoundingMethod is meaningless if ReinforcementSettings FabricRoundingManager IsActiveOnElement is false.
# See Also
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace